algorithms/122-Best Time to Buy and Sell Stock II.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>122.Best Time to Buy and Sell Stock II</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">122.Best Time to Buy and Sell Stock II</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1043258">1. 题意分析</a></li>
<li><a href="#org63bc836">2. java</a></li>
<li><a href="#org163eaf6">3. python</a></li>
</ul>
</div>
</div>
<p>
Say you have an array for which the ith element is the price of a given stock on day i.<br>
</p>

<p>
Design an algorithm to find the maximum profit.<br>
</p>

<p>
You may complete as many transactions as you like (i.e., buy one and sell one share of the stock multiple times).<br>
</p>

<p>
Note: You may not engage in multiple transactions at the same time (i.e., you must sell the stock before you buy again).<br>
</p>

<p>
Example 1:<br>
</p>
<pre class="example">
Input: [7,1,5,3,6,4]
Output: 7

Explanation: Buy on day 2 (price = 1) and sell on day 3 (price = 5), profit = 5-1 = 4.
             Then buy on day 4 (price = 3) and sell on day 5 (price = 6), profit = 6-3 = 3.
</pre>
<p>
Example 2:<br>
</p>
<pre class="example">
Input: [1,2,3,4,5]
Output: 4
Explanation: Buy on day 1 (price = 1) and sell on day 5 (price = 5), profit = 5-1 = 4.
             Note that you cannot buy on day 1, buy on day 2 and sell them later, 
             as you are engaging multiple transactions at the same time. 
             You must sell before buying again.
</pre>
<p>
Example 3:<br>
</p>
<pre class="example">
Input: [7,6,4,3,1]
Output: 0
Explanation: In this case, no transaction is done, i.e. max profit = 0.
</pre>


<div id="outline-container-org1043258" class="outline-2">
<h2 id="org1043258"><span class="section-number-2">1</span> 题意分析</h2>
<div class="outline-text-2" id="text-1">
<p>
给定一个数组，可以多次买入卖出，求最大利益<br>
</p>

<p>
每次操作取极大值、极小值<br>
</p>
</div>
</div>

<div id="outline-container-org63bc836" class="outline-2">
<h2 id="org63bc836"><span class="section-number-2">2</span> java</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #9d0006;">class</span> <span style="color: #8f3f71;">Solution</span> {
    <span style="color: #9d0006;">public</span> <span style="color: #8f3f71;">int</span> <span style="color: #b57614;">maxProfit</span>(<span style="color: #8f3f71;">int</span>[] <span style="color: #076678;">prices</span>) {
            <span style="color: #8f3f71;">int</span> <span style="color: #076678;">profit</span> = 0, <span style="color: #076678;">i</span> = 0, <span style="color: #076678;">j</span>;
            <span style="color: #9d0006;">while</span> (i &lt; prices.<span style="color: #8f3f71;">length</span>) {
                j = i;
                <span style="color: #9d0006;">while</span> (j &lt; prices.<span style="color: #8f3f71;">length</span> - 1 &amp;&amp; prices[j] &lt; prices[j+1]) j=j+1;
                profit += (prices[j] - prices[i]);
                i = j + 1;
            }
            <span style="color: #9d0006;">return</span> profit;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org163eaf6" class="outline-2">
<h2 id="org163eaf6"><span class="section-number-2">3</span> python</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
class Solution(object):
    def maxProfit(self, prices):
        """
        :param prices: List[int]
        :return: int
        """
        res, i = 0, 0
        while i &lt; len(prices):
            j = i
            while j + 1 &lt; len(prices) and prices[j + 1] &gt; prices[j]:
                j += 1
            res += prices[j] - prices[i]
            i = j + 1
        return res
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>